src/Catalogs/Сделки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>Сделки</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидСделки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыСделок</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Врач</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВходящийНомерТелефона</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаЗавершенияСделки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСделки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Заявка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Заявки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИсточникИнформации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РекламныеИсточники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИсточникИнформацииЗначение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КаналПривлечения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КаналыПривлечения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КаналПривлеченияЗначение</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Мессенджеры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодСинхронизации</Name>
					<Comment>Необходим для конвертации бизнес-процессов в сделки</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>12</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КурсЛечения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КурсыЛечения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Лечение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Лечения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Менеджер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеСокращенное</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>32</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПланЛечения</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ПланЛечения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредыдущийПрием</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Прием</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПрефиксСинхронизации</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>5</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Прием</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Прием</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Примечание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>64</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПричинаОтказа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПричиныОтказов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РезультатСделки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.РезультатыСделок</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Специализация</Name>
					<Comment>Специализация</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Специализации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатусПациента</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтруктурнаяЕдиница</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаСделки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭтапОтказа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЭтапыСделок</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭтапСделки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЭтапыСделок</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭтапУспеха</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЭтапыСделок</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ИсторияИзмененияЭтапов</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Дата</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПереходСЭтапа</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЭтапыСделок</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПереходНаЭтап</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЭтапыСделок</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Автор</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/InformationRegisters/ЖурналРегистрацииТриггерныхСобытий.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>ЖурналРегистрацииТриггерныхСобытий</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Взаимодействие</Name>
					<Type>
						<v8:Type>cfg:TaskRef.Взаимодействие</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>SMSРассылка</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.РассылкаСообщений</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЭлектронноеПисьмоИсходящее</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЭлектронноеПисьмоИсходящее</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сделка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сделки</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>IDСообщения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>128</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыРегистрацииСобытий</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сообщение</Name>
					<Comment>Сообщение о коллизии</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ТриггерноеСобытие</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТриггерныеСобытия</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОбъектСобытия</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ОбъектТриггерногоСобытия</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИсточникСобытия</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ИсточникТриггерногоСобытия</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИдентификаторДействия</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>РегистрацияПоПодписке</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/InformationRegisters/СделкиСведенияДляСписка.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>СделкиСведенияДляСписка</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ВидСделки</Name>
					<Comment>Вид сделки</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыСделок</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Номер</Name>
					<Comment>Порядковый номер сделки в разрезе пациента и структурной единицы</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗапланированнаяПредварительнаяЗапись</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Событие</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗапланированнаяЗадача</Name>
					<Type>
						<v8:Type>cfg:TaskRef.Взаимодействие</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПоследняяЗадача</Name>
					<Type>
						<v8:Type>cfg:TaskRef.Взаимодействие</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПерваяДляВрача</Name>
					<Comment>Флаг первой сделки в разрезе врач/пациент</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Сделка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сделки</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/InformationRegisters/СтатусыКонтрагентов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>СтатусыКонтрагентов</Name>
			<Comment>Статусы пациентов</Comment>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/InformationRegisters/СтекИзмененийСтатусовСквознойАналитики.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>СтекИзмененийСтатусовСквознойАналитики</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДатаИзменения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЭтапСделки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЭтапыСделок</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сделки</v8:Type>
						<v8:Type>cfg:CatalogRef.Заявки</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВнешняяСистема</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВнешниеСистемы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыСквознойАналитики</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/Enums/РезультатыСделок.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>РезультатыСделок</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Отказ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Успех</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Catalogs/Сделки/Ext/ObjectModule.bsl
#Область ОбработчикиСобытий

// Процедура - Обработка заполнения.
//
// Параметры:
//  ДанныеЗаполнения	 - 	 - 
//  ТекстЗаполнения		 - 	 - 
//  СтандартнаяОбработка - 	 - 
//
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	ТекущийПользователь 		  = ПараметрыСеанса.ТекущийСотрудник;
	ЭтотОбъект.Автор 			  = ТекущийПользователь;
	ЭтотОбъект.Менеджер 		  = ТекущийПользователь;
	ЭтотОбъект.ДатаСделки 		  = ТекущаяДатаСеанса();
	ЭтотОбъект.СтруктурнаяЕдиница = ПараметрыСеанса.ТекущаяСтруктурнаяЕдиница;
	
	Если ЗначениеЗаполнено(ДанныеЗаполнения)
		И ТипЗнч(ДанныеЗаполнения) = Тип("Структура") Тогда
		
		ЭтотОбъект.ВидСделки      	  	= ?(ДанныеЗаполнения.Свойство("ВидСделки")     	 	, ДанныеЗаполнения.ВидСделки     	  	, ЭтотОбъект.ВидСделки);
		ЭтотОбъект.ДатаСделки         	= ?(ДанныеЗаполнения.Свойство("ДатаСделки")        	, ДанныеЗаполнения.ДатаСделки        	, ТекущаяДатаСеанса());
		ЭтотОбъект.Заявка             	= ?(ДанныеЗаполнения.Свойство("Заявка")            	, ДанныеЗаполнения.Заявка            	, ЭтотОбъект.Заявка);
		ЭтотОбъект.Контрагент         	= ?(ДанныеЗаполнения.Свойство("Контрагент")        	, ДанныеЗаполнения.Контрагент        	, ЭтотОбъект.Контрагент);
		//ЭтотОбъект.ЧленствоПакетУслуг = ?(ДанныеЗаполнения.Свойство("ЧленствоПакетУслуг")	, ДанныеЗаполнения.ЧленствоПакетУслуг	, ЭтотОбъект.ЧленствоПакетУслуг);
		ЭтотОбъект.СтруктурнаяЕдиница 	= ?(ДанныеЗаполнения.Свойство("СтруктурнаяЕдиница")	, ДанныеЗаполнения.СтруктурнаяЕдиница	, ЭтотОбъект.СтруктурнаяЕдиница);
		ЭтотОбъект.ЭтапСделки 		  	= ?(ДанныеЗаполнения.Свойство("ЭтапСделки")		 	, ДанныеЗаполнения.ЭтапСделки		  	, ЭтотОбъект.ЭтапСделки);
		                                                                                                                          	
		ЭтотОбъект.КаналПривлечения				 = ?(ДанныеЗаполнения.Свойство("КаналПривлечения")			, ДанныеЗаполнения.КаналПривлечения				, ЭтотОбъект.КаналПривлечения);
		ЭтотОбъект.КаналПривлеченияЗначение		 = ?(ДанныеЗаполнения.Свойство("КаналПривлеченияЗначение")	, ДанныеЗаполнения.КаналПривлеченияЗначение		, ЭтотОбъект.КаналПривлеченияЗначение);
		ЭтотОбъект.РезультатСделки				 = ?(ДанныеЗаполнения.Свойство("РезультатСделки")			, ДанныеЗаполнения.РезультатСделки				, ЭтотОбъект.РезультатСделки);
		ЭтотОбъект.ИсточникИнформации			 = ?(ДанныеЗаполнения.Свойство("ИсточникИнформации")		, ДанныеЗаполнения.ИсточникИнформации			, ЭтотОбъект.ИсточникИнформации);
		ЭтотОбъект.ИсточникИнформацииЗначение	 = ?(ДанныеЗаполнения.Свойство("ИсточникИнформацииЗначение"), ДанныеЗаполнения.ИсточникИнформацииЗначение	, ЭтотОбъект.ИсточникИнформацииЗначение);
		ЭтотОбъект.СуммаСделки					 = ?(ДанныеЗаполнения.Свойство("СуммаСделки")				, ДанныеЗаполнения.СуммаСделки					, ЭтотОбъект.СуммаСделки);
		ЭтотОбъект.КодСинхронизации				 = ?(ДанныеЗаполнения.Свойство("КодСинхронизации")			, ДанныеЗаполнения.КодСинхронизации				, ЭтотОбъект.КодСинхронизации);
		ЭтотОбъект.Автор						 = ?(ДанныеЗаполнения.Свойство("Автор")						, ДанныеЗаполнения.Автор						, ТекущийПользователь);
		ЭтотОбъект.Менеджер						 = ?(ДанныеЗаполнения.Свойство("Менеджер")					, ДанныеЗаполнения.Менеджер						, ТекущийПользователь);
		ЭтотОбъект.Врач							 = ?(ДанныеЗаполнения.Свойство("Врач")						, ДанныеЗаполнения.Врач							, ЭтотОбъект.Врач);
		ЭтотОбъект.Специализация				 = ?(ДанныеЗаполнения.Свойство("Специализация")				, ДанныеЗаполнения.Специализация				, ЭтотОбъект.Специализация);		
		ЭтотОбъект.Прием						 = ?(ДанныеЗаполнения.Свойство("Прием")						, ДанныеЗаполнения.Прием						, ЭтотОбъект.Прием);
		ЭтотОбъект.ПредыдущийПрием				 = ?(ДанныеЗаполнения.Свойство("ПредыдущийПрием")			, ДанныеЗаполнения.ПредыдущийПрием				, ЭтотОбъект.ПредыдущийПрием);		
		ЭтотОбъект.Описание						 = ?(ДанныеЗаполнения.Свойство("Описание")  		 		, ДанныеЗаполнения.Описание						, ЭтотОбъект.Описание);
		ЭтотОбъект.КурсЛечения					 = ?(ДанныеЗаполнения.Свойство("КурсЛечения")				, ДанныеЗаполнения.КурсЛечения					, ЭтотОбъект.КурсЛечения);
		ЭтотОбъект.Лечение						 = ?(ДанныеЗаполнения.Свойство("Лечение")					, ДанныеЗаполнения.Лечение						, ЭтотОбъект.Лечение);
		ЭтотОбъект.СтатусПациента      	  		 = ?(ДанныеЗаполнения.Свойство("СтатусПациента")     	 	, ДанныеЗаполнения.СтатусПациента     	  		, ЭтотОбъект.СтатусПациента);
		ЭтотОбъект.ВходящийНомерТелефона    	 = ?(ДанныеЗаполнения.Свойство("ВходящийНомерТелефона")  	, ДанныеЗаполнения.ВходящийНомерТелефона    	, ЭтотОбъект.ВходящийНомерТелефона);
		
		Если НЕ ЗначениеЗаполнено(ЭтотОбъект.Наименование) 
			И ДанныеЗаполнения.Свойство("СформироватьНаименование") 
			И ДанныеЗаполнения.СформироватьНаименование
			И ЗначениеЗаполнено(ЭтотОбъект.ВидСделки) Тогда 
			
			Если НЕ ЗначениеЗаполнено(Код) Тогда	
				ЭтотОбъект.УстановитьНовыйКод();		
			КонецЕсли;
			ЭтотОбъект.Наименование = Справочники.Сделки.СоздатьНаименованиеСделки(ЭтотОбъект);		
		КонецЕсли;	
	КонецЕсли;
	
	// Пробуем получить заявку пациента
	ИнициализироватьЗаявкуПациента();
	
	Если НЕ ЗначениеЗаполнено(ЭтотОбъект.Специализация) Тогда 
		Если ЗначениеЗаполнено(ЭтотОбъект.Врач) Тогда 
			ЭтотОбъект.Специализация = Справочники.Сотрудники.ПолучитьОсновнуюСпециализациюСотрудника(ЭтотОбъект.Врач);
		КонецЕсли;	
	КонецЕсли;
	
	// Установить статусы пациента 
	Если НЕ ЗначениеЗаполнено(ЭтотОбъект.СтатусПациента) Тогда
		ЭтотОбъект.СтатусПациента = Справочники.Сделки.ВернутьПризнакПервичногоПациента(ЭтотОбъект);
	КонецЕсли;
	
КонецПроцедуры

// Процедура - При копировании
//
// Параметры:
//  ОбъектКопирования	 - 	 - 
//
Процедура ПриКопировании(ОбъектКопирования)
	
	ЭтотОбъект.Автор 				= ПараметрыСеанса.ТекущийСотрудник;
	ЭтотОбъект.ДатаЗавершенияСделки = Дата(1,1,1);
	ЭтотОбъект.ДатаСделки 			= ТекущаяДатаСеанса();
	ЭтотОбъект.ПричинаОтказа 		= Неопределено;
	ЭтотОбъект.Прием 				= Неопределено;
	ЭтотОбъект.РезультатСделки 		= Перечисления.РезультатыСделок.ПустаяСсылка();
	ЭтотОбъект.ЭтапОтказа 			= Неопределено;
	ЭтотОбъект.ЭтапУспеха 			= Неопределено;
	Если ЗначениеЗаполнено(ОбъектКопирования.ЭтапСделки) И ОбщегоНазначения.ПолучитьЗначениеРеквизита(ОбъектКопирования.ЭтапСделки, "Предопределенный") Тогда 
		ЭтотОбъект.ЭтапСделки 		= Справочники.ЭтапыСделок.ПолучитьЭтапПоНомеру(ОбъектКопирования.ВидСделки, 1);
	КонецЕсли;	
	ЭтотОбъект.НаименованиеСокращенное = "";
	ЭтотОбъект.КурсЛечения 			= Неопределено;
	ЭтотОбъект.Лечение 				= Неопределено;
	ЭтотОбъект.СтатусПациента 		= Перечисления.СтатусыКонтрагентов.ПустаяСсылка();
	
КонецПроцедуры

// Процедура - Обработка проверки заполнения
//
// Параметры:
//  Отказ				 - 	 - 
//  ПроверяемыеРеквизиты - 	 - 
//
Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	//Если НЕ ЗначениеЗаполнено(ЭтотОбъект.Врач) И НЕ ЗначениеЗаполнено(ЭтотОбъект.Специализация) Тогда 
	//	Если ПроверяемыеРеквизиты.Найти("Специализация") = Неопределено Тогда 
	//		ПроверяемыеРеквизиты.Добавить("Специализация");
	//	КонецЕсли;
	//КонецЕсли;	
	
КонецПроцедуры

// Процедура - Перед записью.
//
// Параметры:
//  Отказ	 - 	 - 
//
Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка = Истина Тогда 
		Возврат;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Код) Тогда	
		ЭтотОбъект.УстановитьНовыйКод();		
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ЭтотОбъект.Наименование) Тогда		
		ЭтотОбъект.Наименование = Справочники.Сделки.СоздатьНаименованиеСделки(ЭтотОбъект);		
	КонецЕсли;
	ЭтотОбъект.НаименованиеСокращенное = Справочники.Сделки.ИнициализироватьСокращенноеНаименованиеСделки(ЭтотОбъект);		
	
	Если ЭтотОбъект.ИсточникИнформации <> Справочники.РекламныеИсточники.ДругойПациент Тогда		
		ЭтотОбъект.ИсточникИнформацииЗначение = Неопределено;		
	КонецЕсли;
	
	Если ЭтотОбъект.КаналПривлечения <> Справочники.КаналыПривлечения.ЧатСКлиентом Тогда		
		ЭтотОбъект.КаналПривлеченияЗначение = Неопределено;		
	КонецЕсли;
	
	// Установить статусы пациента 
	Если НЕ ЗначениеЗаполнено(ЭтотОбъект.СтатусПациента) Тогда
		ЭтотОбъект.СтатусПациента = Справочники.Сделки.ВернутьПризнакПервичногоПациента(ЭтотОбъект);
	КонецЕсли;

	// Фиксация даты завершения сделки
	ЗафиксироватьДатуЗавершенияСделки();
	
	// Инициализация дополнительных свойств объекта
	ИнициализироватьДополнительныеСвойстваОбъекта();
	
	//ВнешняяСистемаCalltouch = Справочники.ВнешниеСистемы.ПолучитьВнешнююСистему(, Перечисления.ТипыВнешнихСистем.Calltouch, Истина);
	//ВнешняяСистемаЯМетрика  = Справочники.ВнешниеСистемы.ПолучитьВнешнююСистему(, Перечисления.ТипыВнешнихСистем.ЯндексАналитика, Истина);
		
	// Заполним специализацию
	Если НЕ ЗначениеЗаполнено(ЭтотОбъект.Специализация) Тогда 
		Если ЗначениеЗаполнено(ЭтотОбъект.Врач) Тогда 
			ЭтотОбъект.Специализация = Справочники.Сотрудники.ПолучитьОсновнуюСпециализациюСотрудника(ЭтотОбъект.Врач);
		КонецЕсли;	
	КонецЕсли;
	
	// Заполним куратора	
	Если НЕ ЗначениеЗаполнено(ЭтотОбъект.Менеджер) Тогда 
		ТекущийСотрудник = ПараметрыСеанса.ТекущийСотрудник;
		Если ЗначениеЗаполнено(ТекущийСотрудник) И ОбщегоНазначения.ПолучитьЗначениеРеквизита(ТекущийСотрудник, "Служебный") = Ложь Тогда 
			ЭтотОбъект.Менеджер = ТекущийСотрудник;
		КонецЕсли;	
	КонецЕсли;
	
	// Проверка на существование сделок клиента с таким же видом и врачом
	ПроверитьБизнесЛогикуСоздания(, , Истина, Отказ);

	// Фиксация изменения этапа в истории (ТЧ)
	ЗафиксироватьИсториюИзмененияЭтапов();
	
	// Синхронизация сделки с заявкой
	СинхронизироватьОбъектСЗаявкой();
	
КонецПроцедуры

// Процедура, обработчик события "ПриЗаписи".
//
Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка = Истина Тогда 
		Возврат;
	КонецЕсли;	
	
	Если ДополнительныеСвойства.Свойство("ПараметрыРегистрацииТриггера") Тогда
		ДополнительныеСвойства.ПараметрыРегистрацииТриггера.Вставить("ОбъектГенерации", ЭтотОбъект.Ссылка);		
		РегистрыСведений.ЖурналРегистрацииТриггерныхСобытий.ЗарегистрироватьСобытиеТриггера(ДополнительныеСвойства.ПараметрыРегистрацииТриггера);
	КонецЕсли;
	
	ОбновитьЗаписиРегистраКонтрагентыСведенияДляСписка();
	РегистрыСведений.СделкиСведенияДляСписка.АктуализироватьСведенияДляСписка(ЭтотОбъект.Ссылка, ЭтотОбъект.Контрагент);
	
	Если ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ЭтотОбъект.ДополнительныеСвойства, "ИзмененЭтап", Ложь)
		И НЕ ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ЭтотОбъект.ДополнительныеСвойства, "РегламентнаяЗапись", Ложь) Тогда
		Если ЭтотОбъект.ВидСделки = ОбщегоНазначения.ПредопределенныйЭлемент("Справочник.ВидыСделок.НовыеПациенты") Тогда
			Если ЭтотОбъект.ЭтапСделки = Справочники.ЭтапыСделок.ПолучитьЭтапПоНомеру(ЭтотОбъект.ВидСделки, 4) Тогда 
            	Документы.Событие.УстановитьСтатусПредварительнойЗаписи(Перечисления.СтатусыСобытия.Подтверждена, , ЭтотОбъект.Ссылка);
			КонецЕсли;	
		КонецЕсли;
	КонецЕсли;
		
	Если ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ЭтотОбъект.ДополнительныеСвойства, "УстановленЭтапОтказ", Ложь) Тогда 
		РегистрыСведений.Профосмотры.АктуализироватьСтатусПланированияПриема(ЭтотОбъект.СтруктурнаяЕдиница
																			, ЭтотОбъект.Контрагент
																			, ЭтотОбъект.Ссылка
																			, 
																			, Перечисления.СтатусыПрофосмотров.Отказался
																			, ЭтотОбъект.ПричинаОтказа);
	КонецЕсли;
	
	Если ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ЭтотОбъект.ДополнительныеСвойства, "ЭтоНовый", Ложь) Тогда
		ОповеститьСеансыОбИзмененииСделки("ДобавленаСделка");
	ИначеЕсли ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ЭтотОбъект.ДополнительныеСвойства, "ИзмененЭтап", Ложь) Тогда
		ОповеститьСеансыОбИзмененииСделки("ИзмененЭтапСделки");
	КонецЕсли;
	
	ОбновитьСделкуВПродаже();
	
	ОбновитьСтатусКлиента();
	
	ИнициализироватьСтекСтатусовСквознойАналитики();
	
	// Синхронизации проведена. Фиксируем результаты, если есть.
	СинхронизироватьОбъектСЗаявкой();
	
	СинхронизироватьОбъектСЗадачей();
	
	// Завершаем связанные задачи
	Если ДополнительныеСвойства.Свойство("ЗавершитьВсеСвязанныеЗадачи") Тогда 
		СтруктураПараметров = Новый Структура;
		СтруктураПараметров.Вставить("Сделка"					, Ссылка);
		СтруктураПараметров.Вставить("РезультатСделки"			, РезультатСделки);
		СтруктураПараметров.Вставить("СтруктурнаяЕдиница"		, СтруктурнаяЕдиница);
		СтруктураПараметров.Вставить("ДополнительныеСвойства"	, ДополнительныеСвойства);
		ПараметрыДлительнойОперации = ЗагрузкаПроведениеДокументов.НачатьЗавершениеСвязанныхЗадач(Строка(Новый УникальныйИдентификатор()), СтруктураПараметров);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Процедура - Зафиксировать дату завершения сделки
//
Процедура ЗафиксироватьДатуЗавершенияСделки()
	
	Если НЕ ЗначениеЗаполнено(ДатаЗавершенияСделки) Тогда 
		Если ЭтапСделки = Справочники.ЭтапыСделок.Успех И ЗначениеЗаполнено(Прием) Тогда 
			ДатаЗавершенияСделки = ТекущаяДатаСеанса();
		ИначеЕсли ЭтапСделки = Справочники.ЭтапыСделок.Отказ Тогда 
			ДатаЗавершенияСделки = ТекущаяДатаСеанса();
		КонецЕсли;
	Иначе
		Если ЗначениеЗаполнено(РезультатСделки) Тогда
			ДатаЗавершенияСделки = ТекущаяДатаСеанса();
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

// Процедура - Проверить бизнес логику создания
//
// Параметры:
//  СделкаАналог - 	 - 
//  Комментарий	 - 	 - 
//  Отказ		 - 	 - 
//
Процедура ПроверитьБизнесЛогикуСоздания(СделкаАналог = Неопределено, Комментарий = "", СообщатьПользователю = Ложь, Отказ) Экспорт
	
	КомментарийОшибкиЗаписи = "";
	Справочники.Сделки.ПроверитьБизнесЛогикуСоздания(ЭтотОбъект, СделкаАналог, КомментарийОшибкиЗаписи, СообщатьПользователю, Отказ);
	Если Отказ И ЗначениеЗаполнено(КомментарийОшибкиЗаписи) Тогда 
		ВызватьИсключение КомментарийОшибкиЗаписи;
	КонецЕсли;
	
КонецПроцедуры

// Процедура, обновить статус клиента.
//
Процедура ОбновитьСтатусКлиента()
	
	Если НЕ ЗначениеЗаполнено(Контрагент) Тогда
		Возврат;
	КонецЕсли;
	
	//Если РезультатСделки = Перечисления.РезультатыСделок.Отказ ИЛИ НЕ ЗначениеЗаполнено(РезультатСделки) Тогда 
	//	РегистрыСведений.СтатусыКонтрагентов.АктуализироватьСтатусКлиента(Контрагент);
	//КонецЕсли;	

	//Если ЭтотОбъект.ВидСделки = ОбщегоНазначения.ПредопределенныйЭлемент("Справочник.ВидыСделок.НовыеПациенты") Тогда 
	//	СтатусПациента = Справочники.Контрагенты.ПолучитьСтатус(Контрагент, СтруктурнаяЕдиница);
	//	
	//	Если ЭтотОбъект.РезультатСделки = Перечисления.РезультатыСделок.Отказ
	//		И ЗначениеЗаполнено(ПричинаОтказа) Тогда
	//		// Если клиент отказался от сделки, ставим статус отказ.
	//		РегистрыСведений.СтатусыКонтрагентов.УстановитьСтатусПациенту(Контрагент
	//		, Перечисления.СтатусыКонтрагентов.Отказ
	//		, СтруктурнаяЕдиница
	//		, ДатаЗавершенияСделки);
	//		
	//	ИначеЕсли СтатусПациента = Перечисления.СтатусыКонтрагентов.Отказ Тогда
	//		// Если клиент имеет статус отказ и создали новую сделку, меняем статус на потенциального.
	//		РегистрыСведений.СтатусыКонтрагентов.УстановитьСтатусПациенту(Контрагент
	//		, Перечисления.СтатусыКонтрагентов.Потенциальный
	//		, СтруктурнаяЕдиница);
	//		
	//	КонецЕсли;
	//КонецЕсли;
	
	Если ЭтотОбъект.ВидСделки = ОбщегоНазначения.ПредопределенныйЭлемент("Справочник.ВидыСделок.НовыеПациенты") 
		ИЛИ ЭтотОбъект.ВидСделки = ОбщегоНазначения.ПредопределенныйЭлемент("Справочник.ВидыСделок.ПостоянныеПациенты") Тогда
		
		РегистрыСведений.СтатусыКонтрагентов.АктуализироватьСтатусПациента(Контрагент);
	КонецЕсли;
	
КонецПроцедуры

// Процедура, обнвляет записи регистра контрагенты сведения для списка.
//
Процедура ОбновитьЗаписиРегистраКонтрагентыСведенияДляСписка()

	Если НЕ ЗначениеЗаполнено(Контрагент) Тогда
		Возврат;
	КонецЕсли;
	
	Блокировка = Новый БлокировкаДанных;
	ЭлементБлокировки = Блокировка.Добавить();
	ЭлементБлокировки.Область = "РегистрСведений.КонтрагентыСведенияДляСписка";
	ЭлементБлокировки.УстановитьЗначение("Контрагент", Контрагент);
	ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
	Блокировка.Заблокировать();

	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	|	Сделки.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.Сделки КАК Сделки
	|ГДЕ
	|	Сделки.Контрагент = &Контрагент
	|	И НЕ Сделки.ПометкаУдаления
	|
	|УПОРЯДОЧИТЬ ПО
	|	Сделки.ДатаСделки УБЫВ";
	
	Запрос.УстановитьПараметр("Контрагент", Контрагент);
	Выборка = Запрос.Выполнить().Выбрать();
	
	МенеджерЗаписи = РегистрыСведений.КонтрагентыСведенияДляСписка.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Контрагент = Контрагент;
	МенеджерЗаписи.Прочитать();
	
	Если НЕ МенеджерЗаписи.Выбран() Тогда
		МенеджерЗаписи.Контрагент = Контрагент;
	КонецЕсли;
	
	Если Выборка.Следующий() Тогда
		
		ПоследняяСделка = Выборка.Ссылка;
			
		МенеджерЗаписи.ТекущаяСделка     = ПоследняяСделка;
		МенеджерЗаписи.ТекущийЭтапСделки = ПоследняяСделка.ЭтапСделки;
		
	Иначе 
		
		МенеджерЗаписи.ТекущаяСделка     = Справочники.Сделки.ПустаяСсылка();
		МенеджерЗаписи.ТекущийЭтапСделки = Справочники.ЭтапыСделок.ПустаяСсылка();
						
	КонецЕсли;
	
	МенеджерЗаписи.Записать();

КонецПроцедуры

// Процедура - Зафиксировать историю изменения этапов
//
Процедура ЗафиксироватьИсториюИзмененияЭтапов()
	
	Если ЗначениеЗаполнено(ЭтотОбъект.ЭтапСделки) Тогда
		Если ЭтотОбъект.Ссылка.Пустая() Тогда 
			ПереходСЭтапа = Справочники.ЭтапыСделок.ПустаяСсылка();
			ПереходНаЭтап = ЭтотОбъект.ЭтапСделки;
		ИначеЕсли ЭтотОбъект.ЭтапСделки <> ЭтотОбъект.Ссылка.ЭтапСделки Тогда 
			ПереходСЭтапа = ЭтотОбъект.Ссылка.ЭтапСделки;
			ПереходНаЭтап = ЭтотОбъект.ЭтапСделки;
			Если ЭтотОбъект.ЭтапСделки = Справочники.ЭтапыСделок.Отказ Тогда 
				ЭтотОбъект.ДополнительныеСвойства.Вставить("УстановленЭтапОтказ", Истина);
			КонецЕсли;	
		Иначе 
			Возврат;
		КонецЕсли;	
	Иначе 
		Возврат;
	КонецЕсли;
	
	НоваяСтрока 				= ЭтотОбъект.ИсторияИзмененияЭтапов.Добавить();
	НоваяСтрока.Дата 			= ТекущаяДатаСеанса();
	НоваяСтрока.ПереходСЭтапа 	= ПереходСЭтапа;
	НоваяСтрока.ПереходНаЭтап 	= ПереходНаЭтап;
	НоваяСтрока.Автор			= ПараметрыСеанса.ТекущийСотрудник;
	
КонецПроцедуры

// Процедура - Обновить сделку в продаже
//
Процедура ОбновитьСделкуВПродаже()
	
	//Если НЕ ЗначениеЗаполнено(ЭтотОбъект.Реализация) Тогда 
	//	Возврат;
	//КонецЕсли;
	//
	//Если НЕ ПривилегированныйРежим() Тогда 
	//	УстановитьПривилегированныйРежим(Истина);
	//КонецЕсли;
	//
	//Сделка = ОбщегоНазначенияСтоматология.ПолучитьЗначениеРеквизита(ЭтотОбъект.Реализация, "Сделка");
	//
	//Если НЕ ЗначениеЗаполнено(Сделка) Тогда 
	//	Реализация_Объект 			= ЭтотОбъект.Реализация.ПолучитьОбъект();
	//	Реализация_Объект.Сделка 	= ЭтотОбъект.Ссылка;
	//	Реализация_Объект.ОбменДанными.Загрузка = Истина;
	//	Попытка
	//		Реализация_Объект.Записать(РежимЗаписиДокумента.Запись);
	//	Исключение
	//		
	//	КонецПопытки;	
	//КонецЕсли;	
	
	
КонецПроцедуры	

// Процедура - Инициализировать дополнительные свойства объекта
//
Процедура ИнициализироватьДополнительныеСвойстваОбъекта()
	
	Если НЕ ЗначениеЗаполнено(ЭтотОбъект.Ссылка) Тогда			
		ЭтотОбъект.ДополнительныеСвойства.Вставить("СделкаСоздана"				, Истина);
	ИначеЕсли НЕ ЭтотОбъект.Ссылка.ЭтапСделки = ЭтотОбъект.ЭтапСделки Тогда 
		ЭтотОбъект.ДополнительныеСвойства.Вставить("СделкаИзменена"				, Истина);
		ЭтотОбъект.ДополнительныеСвойства.Вставить("ИзмененЭтап"				, Истина);
		Если ЭтотОбъект.ВидСделки = ОбщегоНазначения.ПредопределенныйЭлемент("Справочник.ВидыСделок.НовыеПациенты")
			И ЭтотОбъект.ЭтапСделки = Справочники.ЭтапыСделок.ПолучитьЭтапПоНомеру(ЭтотОбъект.ВидСделки, 4) Тогда 
			ЭтотОбъект.ДополнительныеСвойства.Вставить("ЭтапЗаписьПодтверждена"	, Истина);
		КонецЕсли;
	ИначеЕсли НЕ ЭтотОбъект.ПометкаУдаления И ЭтотОбъект.Ссылка.ПометкаУдаления Тогда
		ЭтотОбъект.ДополнительныеСвойства.Вставить("СделкаИзменена"				, Истина);
	ИначеЕсли ЭтотОбъект.ПометкаУдаления И НЕ ЭтотОбъект.Ссылка.ПометкаУдаления Тогда
		ЭтотОбъект.ДополнительныеСвойства.Вставить("ПометкаУдаленияУстановлена"	, Истина);
	КонецЕсли;		
	
	// По флагу завершим все связанные задачи
	Если НЕ ЭтотОбъект.ПометкаУдаления Тогда 
		Если НЕ (ЭтотОбъект.Ссылка.РезультатСделки = Перечисления.РезультатыСделок.Отказ ИЛИ ЭтотОбъект.Ссылка.РезультатСделки = Перечисления.РезультатыСделок.Успех) 
			И (ЭтотОбъект.РезультатСделки = Перечисления.РезультатыСделок.Отказ ИЛИ ЭтотОбъект.РезультатСделки = Перечисления.РезультатыСделок.Успех) Тогда 
			ДополнительныеСвойства.Вставить("ЗавершитьВсеСвязанныеЗадачи", Истина);
		КонецЕсли;
	
		Если ЭтотОбъект.ВидСделки = ОбщегоНазначения.ПредопределенныйЭлемент("Справочник.ВидыСделок.НовыеПациенты") Тогда 
			ЭтапСделкиЗаписан = Справочники.ЭтапыСделок.ПолучитьЭтапПоНомеру(ЭтотОбъект.ВидСделки, 3);
			Если НЕ ЭтотОбъект.Ссылка.ЭтапСделки = ЭтапСделкиЗаписан И ЭтотОбъект.ЭтапСделки = ЭтапСделкиЗаписан Тогда 
				ДополнительныеСвойства.Вставить("ЗавершитьВсеСвязанныеЗадачи", Истина);
				ДополнительныеСвойства.Вставить("ЗадачаОписание", "Выполнена автоматически в момент записи на прием.");
			КонецЕсли;	
		КонецЕсли;	
	КонецЕсли;
	
КонецПроцедуры

// Процедура - Инициализировать стек статусов сквозной аналитики
//
Процедура ИнициализироватьСтекСтатусовСквознойАналитики()

#Область Аналитика_Calltouch	
	
	ВнешниеСистемыCalltouch = Справочники.ВнешниеСистемы.ПолучитьВнешниеСистемы(Перечисления.ТипыВнешнихСистем.Calltouch);
		
	Для Каждого ВС Из ВнешниеСистемыCalltouch Цикл
		
		Если ЭтотОбъект.ДополнительныеСвойства.Свойство("СделкаИзменена") Тогда
			Если ЭтотОбъект.ЭтапСделки = Справочники.ЭтапыСделок.Отказ Тогда
				РегистрыСведений.СтекИзмененийСтатусовСквознойАналитики.ДобавитьЗапись(ЭтотОбъект.Ссылка, Перечисления.СтатусыСквознойАналитики.СделкаНеСостоялась, ВС.Ссылка);
			ИначеЕсли ЭтотОбъект.ЭтапСделки = Справочники.ЭтапыСделок.Успех Тогда
				РегистрыСведений.СтекИзмененийСтатусовСквознойАналитики.ДобавитьЗапись(ЭтотОбъект.Ссылка, Перечисления.СтатусыСквознойАналитики.СделкаСостоялась, ВС.Ссылка);
			Иначе
				РегистрыСведений.СтекИзмененийСтатусовСквознойАналитики.ДобавитьЗапись(ЭтотОбъект.Ссылка, Перечисления.СтатусыСквознойАналитики.СделкаСменаЭтапа, ВС.Ссылка);
			КонецЕсли;
		ИначеЕсли ЭтотОбъект.ДополнительныеСвойства.Свойство("СделкаСоздана") Тогда
			РегистрыСведений.СтекИзмененийСтатусовСквознойАналитики.ДобавитьЗапись(ЭтотОбъект.Ссылка, Перечисления.СтатусыСквознойАналитики.СделкаСоздана, ВС.Ссылка);
			
			//ИначеЕсли ЭтотОбъект.ДополнительныеСвойства.Свойство("ПометкаУдаленияИзменена") Тогда
			//	
			//	Если ЭтотОбъект.ПометкаУдаления тогда
			//		РегистрыСведений.СтекИзмененийСтатусовСквознойАналитики.ДобавитьЗапись(ЭтотОбъект.Заявка, Перечисления.СтатусыСквознойАналитики.СделкаНеСоздана);		
			//	Иначе
			//		РегистрыСведений.СтекИзмененийСтатусовСквознойАналитики.ДобавитьЗапись(ЭтотОбъект.Заявка, Перечисления.СтатусыСквознойАналитики.СделкаСоздана);	
			//	КонецЕсли;	
		КонецЕсли;	
		
	КонецЦикла;

#КонецОбласти	

#Область Аналитика_CoMagic

	ВнешниеСистемыCoMagic = Справочники.ВнешниеСистемы.ПолучитьВнешниеСистемы(Перечисления.ТипыВнешнихСистем.CoMagic);
	
	Если ЗначениеЗаполнено(ВнешниеСистемыCoMagic) Тогда
		
		УдалитьТекущийЭтапИзСтека = Ложь;
		
		ОбъектСА = ?(ЗначениеЗаполнено(ЭтотОбъект.Заявка), ЭтотОбъект.Заявка, ЭтотОбъект.Ссылка);
		СтатусВСтекеСА = РегистрыСведений.СтекИзмененийСтатусовСквознойАналитики.ВернутьСтатусОбъектаПоСсылке(ОбъектСА);

		Если НЕ СтатусВСтекеСА = Неопределено Тогда		
			УдалитьТекущийЭтапИзСтека = Истина;	
		КонецЕсли;
		
		НовыйСтатусСА = Неопределено;
		Если ЭтотОбъект.ДополнительныеСвойства.Свойство("СделкаИзменена") Тогда			
			
			Если ЭтотОбъект.ЭтапСделки = Справочники.ЭтапыСделок.Отказ Тогда
				НовыйСтатусСА = Перечисления.СтатусыСквознойАналитики.СделкаНеСостоялась;
			ИначеЕсли ЭтотОбъект.ЭтапСделки = Справочники.ЭтапыСделок.Успех Тогда
				НовыйСтатусСА = Перечисления.СтатусыСквознойАналитики.СделкаСостоялась;
			Иначе
				НовыйСтатусСА = Перечисления.СтатусыСквознойАналитики.СделкаСменаЭтапа;
			КонецЕсли;
			
		ИначеЕсли ЭтотОбъект.ДополнительныеСвойства.Свойство("СделкаСоздана") Тогда			
			НовыйСтатусСА = Перечисления.СтатусыСквознойАналитики.СделкаСоздана;			
		ИначеЕсли ЭтотОбъект.ДополнительныеСвойства.Свойство("ПометкаУдаленияУстановлена") Тогда						
			НовыйСтатусСА = Перечисления.СтатусыСквознойАналитики.СделкаУдалена;			
		КонецЕсли;
		
		Если ЗначениеЗаполнено(НовыйСтатусСА) Тогда
			
			Для Каждого ВС Из ВнешниеСистемыCoMagic Цикл
				
				Если УдалитьТекущийЭтапИзСтека Тогда
					РегистрыСведений.СтекИзмененийСтатусовСквознойАналитики.УдалитьЗаписьПоЗаявке(ОбъектСА, ВС.Ссылка, СтатусВСтекеСА);
				КонецЕсли;
				
				РегистрыСведений.СтекИзмененийСтатусовСквознойАналитики.ДобавитьЗапись(ОбъектСА, НовыйСтатусСА, ВС.Ссылка);
				
			КонецЦикла;
			
		КонецЕсли;
		
	КонецЕсли;

#КонецОбласти

#Область Аналитика_ЯндексМетрика

	ВнешняяСистемаЯндексМетрика = Справочники.ВнешниеСистемы.ПолучитьВнешнююСистему(, Перечисления.ТипыВнешнихСистем.ЯндексМетрика, Истина);
	
	Если ЗначениеЗаполнено(ВнешняяСистемаЯндексМетрика) И
		ЗначениеЗаполнено(ОбщегоНазначенияСтоматология.ПолучитьЗначениеРеквизита(ВнешняяСистемаЯндексМетрика, "ТокенДоступа")) Тогда
		
		СтатусСА = Неопределено;
		
		Если ЭтотОбъект.ДополнительныеСвойства.Свойство("СделкаИзменена") Тогда
			
			Если ЭтотОбъект.ЭтапСделки = Справочники.ЭтапыСделок.Отказ Тогда
				СтатусСА = Перечисления.СтатусыСквознойАналитики.СделкаНеСостоялась;
			ИначеЕсли ЭтотОбъект.ЭтапСделки = Справочники.ЭтапыСделок.Успех Тогда
				СтатусСА = Перечисления.СтатусыСквознойАналитики.СделкаСостоялась;
			Иначе
				СтатусСА = Перечисления.СтатусыСквознойАналитики.СделкаСменаЭтапа;
			КонецЕсли;
			
		ИначеЕсли ЭтотОбъект.ДополнительныеСвойства.Свойство("СделкаСоздана") Тогда
			
			СтатусСА = Перечисления.СтатусыСквознойАналитики.СделкаСоздана;
		
		ИначеЕсли ЭтотОбъект.ДополнительныеСвойства.Свойство("ПометкаУдаленияУстановлена") Тогда
			
			СтатусСА = Перечисления.СтатусыСквознойАналитики.СделкаУдалена;
			
		КонецЕсли;
		
		Если ЗначениеЗаполнено(СтатусСА) Тогда
			РегистрыСведений.СтекИзмененийСтатусовСквознойАналитики.ДобавитьЗапись(ЭтотОбъект.Ссылка, СтатусСА, ВнешняяСистемаЯндексМетрика);	
		КонецЕсли;
		
	КонецЕсли;	

#КонецОбласти	
	
КонецПроцедуры

// Процедура - Инициализировать заявку пациента
//
Процедура ИнициализироватьЗаявкуПациента() Экспорт 

	Если НЕ ЗначениеЗаполнено(ЭтотОбъект.Заявка) Тогда
		Если ЭтотОбъект.ВидСделки = ОбщегоНазначения.ПредопределенныйЭлемент("Справочник.ВидыСделок.НовыеПациенты") Тогда 
			Если ЗначениеЗаполнено(ЭтотОбъект.Контрагент) Тогда 
				МассивСтатусов = Новый Массив;
				МассивСтатусов.Добавить(Перечисления.СтатусыЗаявок.НеОбработана);
				МассивСтатусов.Добавить(Перечисления.СтатусыЗаявок.ПропущенныйЗвонок);
				МассивСтатусов.Добавить(Перечисления.СтатусыЗаявок.ОтвеченныйЗвонок);
				МассивСтатусов.Добавить(Перечисления.СтатусыЗаявок.ОтвеченныйДиалог);
				МассивСтатусов.Добавить(Перечисления.СтатусыЗаявок.Перезвонить);
				МассивСтатусов.Добавить(Перечисления.СтатусыЗаявок.Отклонена);
				ЭтотОбъект.Заявка = Справочники.Заявки.ПолучитьЗаявкуКонтрагента(ЭтотОбъект.Контрагент, МассивСтатусов, ЭтотОбъект.СтруктурнаяЕдиница);
			КонецЕсли;	
		Иначе 	
			МассивЗаявок = Справочники.Заявки.ПолучитьМассивАктуальныхЗаявокКонтрагента(,ЭтотОбъект.Контрагент);
			Если МассивЗаявок.Количество() > 0 Тогда
				ЭтотОбъект.Заявка = МассивЗаявок[0];
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;	
	
КонецПроцедуры

// Процедура - Синхронизировать объект с заявкой
//
Процедура СинхронизироватьОбъектСЗаявкой()
	
	// Синхронизации в данной транзакции еще не было. Начинаем.
	Если НЕ ЭтотОбъект.ДополнительныеСвойства.Свойство("ЗаявкаСинхронизации") Тогда
		ЗаявкаКлиента = Неопределено;
		ЭтотОбъект.ДополнительныеСвойства.Вставить("ЗаявкаСинхронизации", ЗаявкаКлиента);
		Если ЭтотОбъект.Ссылка.Пустая() И НЕ ЗначениеЗаполнено(ЭтотОбъект.Заявка) И ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДополнительныеСвойства, "НеобходимаГенерацияЗаявки", Ложь) Тогда
			// Выше поискали. Не нашли. И просят создать заявку.
			ЭтотОбъект.КаналПривлечения 		= ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДополнительныеСвойства, "КаналПривлечения"			, ЭтотОбъект.КаналПривлечения);
			ЭтотОбъект.КаналПривлеченияЗначение = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДополнительныеСвойства, "КаналПривлеченияЗначение"	, ЭтотОбъект.КаналПривлеченияЗначение);
			СсылкаНовойЗаявки 					= Справочники.Заявки.ПолучитьСсылку(Новый УникальныйИдентификатор);
			ЭтотОбъект.ДополнительныеСвойства.Вставить("ЗаявкаСинхронизации", СсылкаНовойЗаявки);
			ЭтотОбъект.Заявка 					= СсылкаНовойЗаявки;				
		ИначеЕсли ЭтотОбъект.Ссылка.Пустая() И НЕ ЗначениеЗаполнено(ЭтотОбъект.Заявка) И ЗначениеЗаполнено(ЭтотОбъект.Контрагент) И ЭтотОбъект.ВидСделки = ОбщегоНазначения.ПредопределенныйЭлемент("Справочник.ВидыСделок.НовыеПациенты") Тогда
			// Еще не искали. Поищем.
			ЗаявкаКлиента = Справочники.Заявки.ПолучитьЗаявкуКонтрагента(ЭтотОбъект.Контрагент, , ЭтотОбъект.СтруктурнаяЕдиница, Истина);
			
			Если НЕ ЗначениеЗаполнено(ЗаявкаКлиента) Тогда
				МассивНомеровТелефона = Справочники.Контрагенты.ПолучитьМассивНомеровТелефонаКонтрагента(ЭтотОбъект.Контрагент);
				ЗаявкаКлиента = Справочники.Заявки.ПолучитьЗаявкуПоНомеруТелефона(МассивНомеровТелефона, , ЭтотОбъект.СтруктурнаяЕдиница, Истина);	
			КонецЕсли;	
			
			Если НЕ ЗначениеЗаполнено(ЗаявкаКлиента) Тогда 
				Возврат;
			КонецЕсли;
			
			// Вроде бы наша заявка
			ЭтотОбъект.Заявка = ЗаявкаКлиента;
			ЭтотОбъект.ДополнительныеСвойства.Вставить("ЗаявкаСинхронизации", ЗаявкаКлиента);
		ИначеЕсли ЭтотОбъект.Ссылка.Пустая() И ЗначениеЗаполнено(ЭтотОбъект.Заявка) И ЗначениеЗаполнено(ЭтотОбъект.Контрагент) И ЭтотОбъект.ВидСделки = ОбщегоНазначения.ПредопределенныйЭлемент("Справочник.ВидыСделок.НовыеПациенты") Тогда 
			ЭтотОбъект.ДополнительныеСвойства.Вставить("ЗаявкаСинхронизации", ЭтотОбъект.Заявка);
		КонецЕсли;	
		
		// Синхронизации проведена. Фиксируем результаты.		
	ИначеЕсли ЗначениеЗаполнено(ЭтотОбъект.ДополнительныеСвойства.ЗаявкаСинхронизации) И ОбщегоНазначения.СсылкаСуществует(ЭтотОбъект.ДополнительныеСвойства.ЗаявкаСинхронизации) Тогда
		// Если заявку нашли ранее обработчика "ПередЗаписью" и передали через доп. свойства
		Если ЭтотОбъект.Ссылка.Пустая() И НЕ ЗначениеЗаполнено(ЭтотОбъект.Заявка) Тогда 
			ЭтотОбъект.Заявка = ЭтотОбъект.ДополнительныеСвойства.ЗаявкаСинхронизации;
			Возврат;
		КонецЕсли;	
		ДанныеЗаявки = ОбщегоНазначения.ПолучитьЗначенияРеквизитов(ЭтотОбъект.ДополнительныеСвойства.ЗаявкаСинхронизации, "Статус, СтруктурнаяЕдиница"); 
		Если НЕ ДанныеЗаявки.Статус = Перечисления.СтатусыЗаявок.Принята ИЛИ НЕ ДанныеЗаявки.СтруктурнаяЕдиница = ЭтотОбъект.СтруктурнаяЕдиница Тогда 
			ЗаявкаОбъект 					= ЭтотОбъект.ДополнительныеСвойства.ЗаявкаСинхронизации.ПолучитьОбъект();
			ЗаявкаОбъект.Статус 			= Перечисления.СтатусыЗаявок.Принята;
			ЗаявкаОбъект.ОсновнойКлиент 	= ЭтотОбъект.Контрагент;
			ЗаявкаОбъект.СтруктурнаяЕдиница = ЭтотОбъект.СтруктурнаяЕдиница;
			ЗаявкаОбъект.АктуализироватьНаименованиеОбращения(Истина);
			ОбсужденияСервер.ДобавитьСообщение("Статус: " + Строка(ЗаявкаОбъект.Ссылка.Статус) + " -> " + Строка(ЗаявкаОбъект.Статус) 
												+ Символы.ПС + "Сотрудник: " + Строка(ПараметрыСеанса.ТекущийСотрудник),ЗаявкаОбъект.Ссылка,, Истина);
			ЗаявкаОбъект.ОбменДанными.Загрузка = Истина;
			Попытка
				ЗаявкаОбъект.Записать();
 			Исключение
				ШаблонКомментария = НСтр("ru = 'Не удалось синхронизировать сделку с заявкой ""%1"". Ошибка при записи заявки
				|по причине: %2'");
				
				Комментарий = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				ШаблонКомментария,
				ЭтотОбъект.ДополнительныеСвойства.ЗаявкаСинхронизации,
				ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
				
				ЗаписьЖурналаРегистрации(
				"Сделки.Синхронизация сделки с заявкой",
				УровеньЖурналаРегистрации.Предупреждение,
				Метаданные.Справочники.Заявки,,
				Комментарий);
				
				//ВызватьИсключение;
			КонецПопытки;	
		КонецЕсли;
	ИначеЕсли ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДополнительныеСвойства, "НеобходимаГенерацияЗаявки", Ложь) И ДополнительныеСвойства.Свойство("ЗаявкаСинхронизации") И НЕ ОбщегоНазначения.СсылкаСуществует(ДополнительныеСвойства.ЗаявкаСинхронизации) Тогда	
		// Создаем заявку
		ДанныеЗаполнения = ЗначениеИзСтрокиВнутр(ЗначениеВСтрокуВнутр(ЭтотОбъект.ДополнительныеСвойства));
		ДанныеЗаполнения.Вставить("СсылкаНовойЗаявки"		, ДополнительныеСвойства.ЗаявкаСинхронизации);
		ДанныеЗаполнения.Вставить("Автор"					, ПараметрыСеанса.ТекущийСотрудник);
		ДанныеЗаполнения.Вставить("ДатаСоздания"			, ЭтотОбъект.ДатаСделки);
		ДанныеЗаполнения.Вставить("СтруктурнаяЕдиница"		, ЭтотОбъект.СтруктурнаяЕдиница);
		ДанныеЗаполнения.Вставить("ОсновнойКлиент"			, ЭтотОбъект.Контрагент);		
 		ДанныеЗаполнения.Вставить("РекламнаяПлощадка"		, ЭтотОбъект.КаналПривлечения);		
		ДанныеЗаполнения.Вставить("КаналПривлеченияЗначение", ЭтотОбъект.КаналПривлеченияЗначение);		
		ДанныеЗаполнения.Вставить("ОсновнойМенеджер"		, ?(ЗначениеЗаполнено(ЭтотОбъект.Менеджер), ЭтотОбъект.Менеджер, ОбщегоНазначения.ПолучитьЗначениеРеквизита(ЭтотОбъект.Контрагент, "Куратор")));
		ДанныеЗаполнения.Вставить("Статус"					, Перечисления.СтатусыЗаявок.Принята);		
		ДанныеЗаполнения.Вставить("ИнтерактивнаяЗапись"		, Истина);
		ДанныеЗаполнения.Вставить("СформироватьНаименование", Истина);		
		ДанныеЗаполнения.Вставить("ВходящийНомерТелефона"	, ЭтотОбъект.ВходящийНомерТелефона);
		
		НоваяЗаявка = Справочники.Заявки.СоздатьНовуюЗаявку(ДанныеЗаполнения, Истина);
		
	КонецЕсли;
	
КонецПроцедуры

// Процедура - Синхронизировать объект с задачей
//
Процедура СинхронизироватьОбъектСЗадачей()
	
	Если НЕ ЗначениеЗаполнено(Контрагент) Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ ПривилегированныйРежим() Тогда 
		УстановитьПривилегированныйРежим(Истина);
	КонецЕсли;
	
	СтатусКлиента = РегистрыСведений.СтатусыКонтрагентов.СтатусКонтрагента(Контрагент);
	Если СтатусКлиента <> Перечисления.СтатусыКонтрагентов.Потенциальный Тогда 
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("СтруктурнаяЕдиница"	, СтруктурнаяЕдиница);
	Запрос.УстановитьПараметр("Контрагент"			, Контрагент);
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ ПЕРВЫЕ 1
	|	Взаимодействие.Ссылка КАК Ссылка
	|ИЗ
	|	Задача.Взаимодействие КАК Взаимодействие
	|ГДЕ
	|	Взаимодействие.ПометкаУдаления = ЛОЖЬ
	|	И Взаимодействие.Выполнена = ЛОЖЬ
	|	И Взаимодействие.СтруктурнаяЕдиница = &СтруктурнаяЕдиница
	|	И Взаимодействие.Контрагент = &Контрагент
	|	И Взаимодействие.Сделка = ЗНАЧЕНИЕ(Справочник.Сделки.ПустаяСсылка)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Взаимодействие.Дата УБЫВ";
	
	ВыборкаЗадачи = Запрос.Выполнить().Выбрать();
	Если ВыборкаЗадачи.Следующий() Тогда 
		Если ЗначениеЗаполнено(ВыборкаЗадачи.Ссылка) Тогда 
			Задача_Объект = ВыборкаЗадачи.Ссылка.ПолучитьОбъект();
			Задача_Объект.Сделка = Ссылка;
			Задача_Объект.ДополнительныеСвойства.Вставить("НеИнициализироватьСделку", Истина);
			Задача_Объект.ОбменДанными.Загрузка = Истина;
			Попытка
				Задача_Объект.Записать();
			Исключение
				
			КонецПопытки;	
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

// Процедура, оповещает другие сеансы об изменении сделки.
//
Процедура ОповеститьСеансыОбИзмененииСделки(КлючОповещения)
	
	УстановитьПривилегированныйРежим(Истина);
	
	НомерТекущегоСеанса	 = НомерСеансаИнформационнойБазы();
	ТекущиеСеансы		 = ПолучитьСеансыИнформационнойБазы();
	
	// Если активен только один сеанс (текущий) - никого не оповещаем.
	Если ТекущиеСеансы.Количество() > 1 Тогда
		
		СистемаВзаимодействияПодключена = ОбсужденияСистемыВзаимодействия.СистемаВзаимодействияВключена() = Истина;
		
		Если Не СистемаВзаимодействияПодключена Тогда
			
			ПараметрыОповещения = Новый Массив;
			ПараметрыОповещения.Добавить(ЭтотОбъект.Ссылка);
			ПараметрыОповещения.Добавить(ЭтотОбъект.ВидСделки);
			
		КонецЕсли;
		
		ПользователиОповещения = Новый Массив;
		
		Для Каждого Сеанс Из ТекущиеСеансы Цикл
			
			Если (Сеанс.ИмяПриложения = "1CV8C"
				Или Сеанс.ИмяПриложения = "WebClient") Тогда
				
				Если НомерТекущегоСеанса = Сеанс.НомерСеанса Тогда
					// Текущий сеанс оповещаем с клиента.
					Продолжить;
				КонецЕсли;
				
				Если СистемаВзаимодействияПодключена Тогда
					ПользователиОповещения.Добавить(Сеанс.Пользователь);
				Иначе
					РегистрыСведений.ОповещениеМониторингКлиента.ДобавитьОповещениеКлиента(
						Сеанс.НомерСеанса,,
						КлючОповещения,
						ТекущаяДатаСеанса(),,,,
						ПараметрыОповещения
					);
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЦикла;
		
		Если СистемаВзаимодействияПодключена И ЗначениеЗаполнено(ПользователиОповещения) Тогда
			
			ДанныеСообщения = Новый Структура;
			ДанныеСообщения.Вставить("Ключ"		, КлючОповещения);
			ДанныеСообщения.Вставить("Сделка"	, ЭтотОбъект.Ссылка);
			ДанныеСообщения.Вставить("ВидСделки", ?(ЗначениеЗаполнено(ЭтотОбъект.ВидСделки), ЭтотОбъект.ВидСделки, Неопределено));
			
			ОбсужденияСистемыВзаимодействия.ДобавитьСообщениеВСистемуВзаимодействия(ДанныеСообщения,, ПользователиОповещения);
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
